chat_system_613319577_actor_description=King Mark. Your King.
chat_system_613319577_snap_start_question=^?^Yes, [player] - what does our Treasure Searcher want of us?
chat_system_613319577_snap_start_answer_0=^?^I'd like to ask you a couple of questions, Your Majesty.
chat_system_613319577_snap_start_answer_1=^?^I'm sorry for disturbing you, Your Majesty.
chat_system_613319577_snap_question_question=^?^I don't have time for gossiping, my young servant. I hope your questions are of some importance?
chat_system_613319577_snap_question_answer_0=^?^I'd like to ask you about your daughter, Princess Amelie.
chat_system_613319577_snap_question_answer_1=^?^You've mentioned the King Kerus. I'd like to know more about him.
chat_system_613319577_snap_question_answer_2=^?^What happened to the previous Searcher?
chat_system_613319577_snap_question_header_2=^?^His name was de'Virre... He was a worthy Searcher, and it was thanks in large part to him that our treasury was regularly filled with gold - and it was through his efforts as well that the Academy's sorcerers acquired many rare artifacts and ancient manuscripts to study.<br>Once he told us that in one such manuscript he had found mention of a mythical Temple of the Undead... We tried to dissuade him from searching this place, but to no avail. A few days later, our Searcher left for parts unknown, and we never set eyes upon him again.
chat_system_613319577_snap_question_answer_3=^?^I'd like to know more about your brother, Carl.
chat_system_613319577_snap_question_header_3=^?^Our brother... Carl was the eldest son, and so of course was heir of the throne - or so our father thought. Carl was very wise and extraordinarily intelligent: he had a keen understanding of science, and he could as well have been a fair and deserving sovereign.<br>But... power held no attraction for him - to our father's chagrin, which was quite apparent at the time. Nevertheless, Carl ultimately declared that he was to devote his life to the sciences he loved so much, for the business of the court simply disturbed him. And so he passed onto me all the rights of the throne and the crown, and moved away to a remote location in the Arlanian province.
chat_system_613319577_snap_question_answer_4=^?^I understand you're familiar with my mentor, Richard?
chat_system_613319577_snap_question_header_4=^?^Yes, we've known each other since our childhood. Richard was the son of my fencing teacher. And Richard, my brother, and I studied fencing together. We became friends. <br>Those were the days... By the way, do you know, [player], how Richard got his nickname? Long ago, he was called "Richard Iron Tooth," because once in a fight he lost his tooth, and his father without a second's thought made an iron tooth for him. <br>And oh my hand ached for days after that fight! - His teeth really are like iron, too! But now of course I cannot even recall what the fight was about...
chat_system_613319577_snap_question_answer_5=^?^I have no more questions; I will disturb Your Majesty no further.
chat_system_613319577_snap_2_question=^?^I don't know if you've heard this - Amelie is my adopted daughter. Sadly, I cannot have children. Even our best mages and doctors have failed to cure me of this plight, whether it be illness or curse.<br><br>But the royal family must be continued! Even my brother, who has little to do with politics, understands that much. Besides, my wife and I wanted to have a child - we wanted to care for a child, and I wanted a descendant to whom I could leave the throne.<br>And so I prayed to all the light gods of Endoria. And the gods replied!
chat_system_613319577_snap_2_answer_0=^?^They cured you?
chat_system_613319577_snap_3_question=^?^No. One day at the door of my bedroom I found a basket, inside of which was a baby. A beautiful child, sent to me by the gods.<br>The guards swore that they didn't close their eyes, and they were completely at a loss to explain how the basket arrived at the door. And when the baby was taken to the Temple to be given a name... The gods themselves spoke to me! They said I was to call the girl Amelie, after the brightest star in the sky, and they predicted a most unusual fate.
chat_system_613319577_snap_3_answer_0=^?^The child, sent by gods?
chat_system_613319577_snap_3_header_0=^?^I know, it sounds incredible. She looks and behaves like a common child, but... She has never been ill! Never! Even the wildest beasts do not touch the princess when she walks in the forest. And words spoken by her often come true. And in her dreams, she can see places she has never been, and people which she has never known!<br>And she knows a thing or two about human nature. Amelie has a sense for good or bad things; she can distinguish lies from truth with great ease.<br>She likes you, [player]. And I rely on the senses of my daughter. Remember this!
chat_system_613319577_snap_0_question=^?^The mage Kerus was one of the brightest stars of the Leonard Dynasty. A thousand years ago, when Demons invaded our world, our King Orto Mellis locked himself up in the capital like a coward. There he gathered the army for his own personal defense, leaving the whole country to the mercy of fate.<br>And then he appeared - Kerus, in whose veins flowed the blood of the Leonards. He was a true Battle Mage, and brought with him a small troop of hardened warriors and mages. My ancestor clearly understood that he would not manage to drive all the Demons away with such a small army...
chat_system_613319577_snap_0_answer_0=^?^(Listen further...)
chat_system_613319577_snap_1_question=^?^But nevertheless he accomplished the impossible! Kerus's troop attacked the portal of Fire, which connected our world to the Demon's Land. They managed to penetrate into the other world and destroy the portal - and by himself, Mage Kerus killed the Archdemon Baal, the commander of the Demons.<br>Kerus and his warriors went forth to their doom, but they returned with victory and rich trophies, among which there was a Chest. The cowardly King Mellis escaped as soon as he heard of the heroes' victorious return. Kerus Leonard thus became king and so the throne of Darion returned to our dynasty.
chat_system_613319577_snap_1_answer_0=^?^(Listen further...)
chat_system_613319577_snap_1_header_0=^?^Thus a ruler of Heron, a small land of mages, rose to become the king of all of Darion. Heon, Arlania and still more provinces joined Darion, which finally formed the state we know today.<br>Kerus created the Magic Academy of Darion, where he brought the artifacts he took from the Demons, for their examination.<br>As Kerus came to the crown, so began the Golden Age of Darion. It was an age of magic and prosperity, and it lasted almost five hundred years.
